src/test/resources/org/springframework/ws/axis1/case2/contractfirst/soap_11/documentLiteral11plainarrays-req.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<param xmlns="http://codefirst.case2.axis1.ws.springframework.org">
			<list>
				<item>36</item>
				<item>-102</item>
			</list>
			<number>37</number>
			<param2>
				<bd>37.98</bd>
				<list>
					<item>str1</item>
					<item>str2</item>
					<item>str3</item>
				</list>
				<number>44</number>
				<param3List xsi:type="ns1:ArrayOfParam3" xmlns:ns1="http://codefirst.case2.axis1.ws.springframework.org">
					<item>
						<lvalue>3</lvalue>
						<svalue>value</svalue>
					</item>
					<item>
						<lvalue>3</lvalue>
						<svalue>value</svalue>
					</item>
				</param3List>
				<param3Tab>
					<item>
						<lvalue>3</lvalue>
						<svalue>value</svalue>
					</item>
					<item>
						<lvalue>3</lvalue>
						<svalue>value</svalue>
					</item>
					<item>
						<lvalue>3</lvalue>
						<svalue>value</svalue>
					</item>
				</param3Tab>
			</param2>
			<param3list>
				<item>
					<lvalue>3</lvalue>
					<svalue>value</svalue>
				</item>
				<item>
					<lvalue>3</lvalue>
					<svalue>value</svalue>
				</item>
				<item>
					<lvalue>3</lvalue>
					<svalue>value</svalue>
				</item>
			</param3list>
			<string>str (String)</string>
		</param>
		<param2 xmlns="http://codefirst.case2.axis1.ws.springframework.org">
			<bd>37.98</bd>
			<list>
				<item>str1</item>
				<item>str2</item>
				<item>str3</item>
			</list>
			<number>44</number>
			<param3List xsi:type="ns2:ArrayOfParam3" xmlns:ns2="http://codefirst.case2.axis1.ws.springframework.org">
				<item>
					<lvalue>3</lvalue>
					<svalue>value</svalue>
				</item>
				<item>
					<lvalue>3</lvalue>
					<svalue>value</svalue>
				</item>
			</param3List>
			<param3Tab>
				<item>
					<lvalue>3</lvalue>
					<svalue>value</svalue>
				</item>
				<item>
					<lvalue>3</lvalue>
					<svalue>value</svalue>
				</item>
				<item>
					<lvalue>3</lvalue>
					<svalue>value</svalue>
				</item>
			</param3Tab>
		</param2>
	</soapenv:Body>
</soapenv:Envelope>
